#pragma once

// Name: Sq, Version: b21


#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

/*!!HELPER_DEF!!*/

/*!!DEFINE!!*/

namespace UFT
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class AIModule.AIController
// 0x008B (FullSize[0x0348] - InheritedSize[0x02BD])
// LastOffsetWithSize(0x02BD)
#define PADDING_09D7 - 0x0000 // Minimum to subtract -> (003B)
class AAIController : public AController
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x003B PADDING_09D7, unsigned char,                                                         bStopAILogicOnUnposses);                                   // 0x02F8(0x0001) BIT_FIELD (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x003B PADDING_09D7, unsigned char,                                                         bLOSflag);                                                 // 0x02F8(0x0001) BIT_FIELD (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x003B PADDING_09D7, unsigned char,                                                         bSkipExtraLOSChecks);                                      // 0x02F8(0x0001) BIT_FIELD (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x003B PADDING_09D7, unsigned char,                                                         bAllowStrafe);                                             // 0x02F8(0x0001) BIT_FIELD (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x003B PADDING_09D7, unsigned char,                                                         bWantsPlayerState);                                        // 0x02F8(0x0001) BIT_FIELD (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x003B PADDING_09D7, unsigned char,                                                         bSetControlRotationFromPawnOrientation);                   // 0x02F8(0x0001) BIT_FIELD (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0043 PADDING_09D7, class UPathFollowingComponent*,                                        PathFollowingComponent);                                   // 0x0300(0x0008)  (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		DEFINE_MEMBER_NNN(0x004B PADDING_09D7, class UBrainComponent*,                                                BrainComponent);                                           // 0x0308(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0053 PADDING_09D7, class UAIPerceptionComponent*,                                         PerceptionComponent);                                      // 0x0310(0x0008)  (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x005B PADDING_09D7, class UPawnActionsComponent*,                                          ActionsComp);                                              // 0x0318(0x0008)  (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		DEFINE_MEMBER_NNN(0x0063 PADDING_09D7, class UBlackboardComponent*,                                           Blackboard);                                               // 0x0320(0x0008)  (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x006B PADDING_09D7, class UGameplayTasksComponent*,                                        CachedGameplayTasksComponent);                             // 0x0328(0x0008)  (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0073 PADDING_09D7, class UClass*,                                                         DefaultNavigationFilterClass);                             // 0x0330(0x0008)  (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x007B PADDING_09D7, struct FScriptMulticastDelegate,                                       ReceiveMoveCompleted);                                     // 0x0338(0x0010)  (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AIController");
		return ptr;
	}


	bool UseBlackboard(class UBlackboardData* BlackboardAsset, class UBlackboardComponent** BlackboardComponent);
	void UnclaimTaskResource(class UClass* ResourceClass);
	void SetPathFollowingComponent(class UPathFollowingComponent* NewPFComponent);
	void SetMoveBlockDetection(bool bEnable);
	bool RunBehaviorTree(class UBehaviorTree* BTAsset);
	void OnUsingBlackBoard(class UBlackboardComponent* BlackboardComp, class UBlackboardData* BlackboardAsset);
	void OnGameplayTaskResourcesClaimed(const struct FGameplayResourceSet& NewlyClaimed, const struct FGameplayResourceSet& FreshlyReleased);
	TEnumAsByte<EPathFollowingRequestResult> MoveToLocation(const struct FVector& Dest, float AcceptanceRadius, bool bStopOnOverlap, bool bUsePathfinding, bool bProjectDestinationToNavigation, bool bCanStrafe, class UClass* FilterClass, bool bAllowPartialPath);
	TEnumAsByte<EPathFollowingRequestResult> MoveToActor(class AActor* Goal, float AcceptanceRadius, bool bStopOnOverlap, bool bUsePathfinding, bool bCanStrafe, class UClass* FilterClass, bool bAllowPartialPath);
	void K2_SetFocus(class AActor* NewFocus);
	void K2_SetFocalPoint(const struct FVector& FP);
	void K2_ClearFocus();
	bool HasPartialPath();
	class UPathFollowingComponent* GetPathFollowingComponent();
	TEnumAsByte<EPathFollowingStatus> GetMoveStatus();
	struct FVector GetImmediateMoveDestination();
	class AActor* GetFocusActor();
	struct FVector GetFocalPointOnActor(class AActor* Actor);
	struct FVector GetFocalPoint();
	class UAIPerceptionComponent* GetAIPerceptionComponent();
	void ClaimTaskResource(class UClass* ResourceClass);
};

// Class AIModule.BTNode
// 0x0028 (FullSize[0x0050] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
#define PADDING_09D8 - 0x0000 // Minimum to subtract -> (0008)
class UBTNode : public UObject
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0008 PADDING_09D8, struct FString,                                                        NodeName);                                                 // 0x0030(0x0010)  (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0018 PADDING_09D8, class UBehaviorTree*,                                                  TreeAsset);                                                // 0x0040(0x0008)  (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		DEFINE_MEMBER_NNN(0x0020 PADDING_09D8, class UBTCompositeNode*,                                               ParentNode);                                               // 0x0048(0x0008)  (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.BTNode");
		return ptr;
	}


};

// Class AIModule.BTAuxiliaryNode
// 0x0008 (FullSize[0x0058] - InheritedSize[0x0050])
// LastOffsetWithSize(0x0050)
class UBTAuxiliaryNode : public UBTNode
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.BTAuxiliaryNode");
		return ptr;
	}


};

// Class AIModule.BTDecorator
// 0x000D (FullSize[0x0065] - InheritedSize[0x0058])
// LastOffsetWithSize(0x0050)
#define PADDING_09DA - 0x0000 // Minimum to subtract -> (0010)
class UBTDecorator : public UBTAuxiliaryNode
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0010 PADDING_09DA, unsigned char,                                                         bInverseCondition);                                        // 0x0060(0x0001) BIT_FIELD (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		DEFINE_MEMBER_NNN(0x0014 PADDING_09DA, TEnumAsByte<EBTFlowAbortMode>,                                         FlowAbortMode);                                            // 0x0064(0x0001)  (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.BTDecorator");
		return ptr;
	}


};

// Class AIModule.BTTaskNode
// 0x0019 (FullSize[0x0069] - InheritedSize[0x0050])
// LastOffsetWithSize(0x0050)
#define PADDING_09DB - 0x0000 // Minimum to subtract -> (0008)
class UBTTaskNode : public UBTNode
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0008 PADDING_09DB, TArray<class UBTService*>,                                             Services);                                                 // 0x0058(0x0010)  (ZeroConstructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0018 PADDING_09DB, unsigned char,                                                         bIgnoreRestartSelf);                                       // 0x0068(0x0001) BIT_FIELD (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.BTTaskNode");
		return ptr;
	}


};

// Class AIModule.BTTask_BlackboardBase
// 0x002F (FullSize[0x0098] - InheritedSize[0x0069])
// LastOffsetWithSize(0x0069)
#define PADDING_09DC - 0x0000 // Minimum to subtract -> (0007)
class UBTTask_BlackboardBase : public UBTTaskNode
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0007 PADDING_09DC, struct FBlackboardKeySelector,                                         BlackboardKey);                                            // 0x0070(0x0028)  (Edit, Protected, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.BTTask_BlackboardBase");
		return ptr;
	}


};

// Class AIModule.AIAsyncTaskBlueprintProxy
// 0x0020 (FullSize[0x0048] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
#define PADDING_09DD - 0x0000 // Minimum to subtract -> (0000)
class UAIAsyncTaskBlueprintProxy : public UObject
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_09DD, struct FScriptMulticastDelegate,                                       OnSuccess);                                                // 0x0028(0x0010)  (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0010 PADDING_09DD, struct FScriptMulticastDelegate,                                       OnFail);                                                   // 0x0038(0x0010)  (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AIAsyncTaskBlueprintProxy");
		return ptr;
	}


	void OnMoveCompleted(const struct FAIRequestID& RequestID, TEnumAsByte<EPathFollowingResult> MovementResult);
};

// Class AIModule.AIBlueprintHelperLibrary
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
class UAIBlueprintHelperLibrary : public UBlueprintFunctionLibrary
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AIBlueprintHelperLibrary");
		return ptr;
	}


	static void STATIC_UnlockAIResourcesWithAnimation(class UAnimInstance* AnimInstance, bool bUnlockMovement, bool UnlockAILogic);
	static class APawn* STATIC_SpawnAIFromClass(class UObject* WorldContextObject, class UClass* PawnClass, class UBehaviorTree* BehaviorTree, const struct FVector& Location, const struct FRotator& Rotation, bool bNoCollisionFail);
	static void STATIC_SimpleMoveToLocation(class AController* Controller, const struct FVector& Goal);
	static void STATIC_SimpleMoveToActor(class AController* Controller, class AActor* Goal);
	static void STATIC_SendAIMessage(class APawn* Target, const struct FName& Message, class UObject* MessageSource, bool bSuccess);
	static void STATIC_LockAIResourcesWithAnimation(class UAnimInstance* AnimInstance, bool bLockMovement, bool LockAILogic);
	static bool STATIC_IsValidAIRotation(const struct FRotator& Rotation);
	static bool STATIC_IsValidAILocation(const struct FVector& Location);
	static bool STATIC_IsValidAIDirection(const struct FVector& DirectionVector);
	static class UNavigationPath* STATIC_GetCurrentPath(class AController* Controller);
	static class UBlackboardComponent* STATIC_GetBlackboard(class AActor* Target);
	static class AAIController* STATIC_GetAIController(class AActor* ControlledActor);
	static class UAIAsyncTaskBlueprintProxy* STATIC_CreateMoveToProxyObject(class UObject* WorldContextObject, class APawn* Pawn, const struct FVector& Destination, class AActor* TargetActor, float AcceptanceRadius, bool bStopOnOverlap);
};

// Class AIModule.AIDataProvider
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
class UAIDataProvider : public UObject
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AIDataProvider");
		return ptr;
	}


};

// Class AIModule.AIDataProvider_QueryParams
// 0x0011 (FullSize[0x0039] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
#define PADDING_09E0 - 0x0000 // Minimum to subtract -> (0000)
class UAIDataProvider_QueryParams : public UAIDataProvider
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_09E0, struct FName,                                                          ParamName);                                                // 0x0028(0x0008)  (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0008 PADDING_09E0, float,                                                                 FloatValue);                                               // 0x0030(0x0004)  (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x000C PADDING_09E0, int,                                                                   IntValue);                                                 // 0x0034(0x0004)  (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0010 PADDING_09E0, bool,                                                                  BoolValue);                                                // 0x0038(0x0001)  (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AIDataProvider_QueryParams");
		return ptr;
	}


};

// Class AIModule.AIDataProvider_Random
// 0x0010 (FullSize[0x0049] - InheritedSize[0x0039])
// LastOffsetWithSize(0x0039)
#define PADDING_09E1 - 0x0000 // Minimum to subtract -> (0007)
class UAIDataProvider_Random : public UAIDataProvider_QueryParams
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0007 PADDING_09E1, float,                                                                 Min);                                                      // 0x0040(0x0004)  (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x000B PADDING_09E1, float,                                                                 Max);                                                      // 0x0044(0x0004)  (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x000F PADDING_09E1, unsigned char,                                                         bInteger);                                                 // 0x0048(0x0001) BIT_FIELD (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AIDataProvider_Random");
		return ptr;
	}


};

// Class AIModule.AIHotSpotManager
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
class UAIHotSpotManager : public UObject
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AIHotSpotManager");
		return ptr;
	}


};

// Class AIModule.AIPerceptionComponent
// 0x00E0 (FullSize[0x01A8] - InheritedSize[0x00C8])
// LastOffsetWithSize(0x00C8)
#define PADDING_09E3 - 0x0000 // Minimum to subtract -> (0010)
class UAIPerceptionComponent : public UActorComponent
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0010 PADDING_09E3, TArray<class UAISenseConfig*>,                                         SensesConfig);                                             // 0x00D8(0x0010)  (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0020 PADDING_09E3, class UClass*,                                                         DominantSense);                                            // 0x00E8(0x0008)  (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0038 PADDING_09E3, class AAIController*,                                                  AIOwner);                                                  // 0x0100(0x0008)  (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x00C0 PADDING_09E3, struct FScriptMulticastDelegate,                                       OnPerceptionUpdated);                                      // 0x0188(0x0010)  (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00D0 PADDING_09E3, struct FScriptMulticastDelegate,                                       OnTargetPerceptionUpdated);                                // 0x0198(0x0010)  (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AIPerceptionComponent");
		return ptr;
	}


	void SetSenseEnabled(class UClass* SenseClass, bool bEnable);
	void RequestStimuliListenerUpdate();
	void OnOwnerEndPlay(class AActor* Actor, TEnumAsByte<EEndPlayReason> EndPlayReason);
	void GetPerceivedHostileActors(TArray<class AActor*>* OutActors);
	void GetPerceivedActors(class UClass* SenseToUse, TArray<class AActor*>* OutActors);
	void GetKnownPerceivedActors(class UClass* SenseToUse, TArray<class AActor*>* OutActors);
	void GetCurrentlyPerceivedActors(class UClass* SenseToUse, TArray<class AActor*>* OutActors);
	bool GetActorsPerception(class AActor* Actor, struct FActorPerceptionBlueprintInfo* Info);
};

// Class AIModule.AIPerceptionListenerInterface
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
class UAIPerceptionListenerInterface : public UInterface
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AIPerceptionListenerInterface");
		return ptr;
	}


};

// Class AIModule.AIPerceptionStimuliSourceComponent
// 0x0028 (FullSize[0x00F0] - InheritedSize[0x00C8])
// LastOffsetWithSize(0x00C8)
#define PADDING_09E5 - 0x0000 // Minimum to subtract -> (0010)
class UAIPerceptionStimuliSourceComponent : public UActorComponent
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0010 PADDING_09E5, unsigned char,                                                         bAutoRegisterAsSource);                                    // 0x00D8(0x0001) BIT_FIELD (Edit, BlueprintVisible, BlueprintReadOnly, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0018 PADDING_09E5, TArray<class UClass*>,                                                 RegisterAsSourceForSenses);                                // 0x00E0(0x0010)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AIPerceptionStimuliSourceComponent");
		return ptr;
	}


	void UnregisterFromSense(class UClass* SenseClass);
	void UnregisterFromPerceptionSystem();
	void RegisterWithPerceptionSystem();
	void RegisterForSense(class UClass* SenseClass);
};

// Class AIModule.AISubsystem
// 0x0010 (FullSize[0x0038] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
#define PADDING_09E6 - 0x0000 // Minimum to subtract -> (0008)
class UAISubsystem : public UObject
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0008 PADDING_09E6, class UAISystem*,                                                      AISystem);                                                 // 0x0030(0x0008)  (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISubsystem");
		return ptr;
	}


};

// Class AIModule.AIPerceptionSystem
// 0x0064 (FullSize[0x009C] - InheritedSize[0x0038])
// LastOffsetWithSize(0x0038)
#define PADDING_09E7 - 0x0000 // Minimum to subtract -> (0050)
class UAIPerceptionSystem : public UAISubsystem
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0050 PADDING_09E7, TArray<class UAISense*>,                                               Senses);                                                   // 0x0088(0x0010)  (ZeroConstructor, Protected, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0060 PADDING_09E7, float,                                                                 PerceptionAgingRate);                                      // 0x0098(0x0004)  (Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AIPerceptionSystem");
		return ptr;
	}


	static void STATIC_ReportPerceptionEvent(class UObject* WorldContextObject, class UAISenseEvent* PerceptionEvent);
	void ReportEvent(class UAISenseEvent* PerceptionEvent);
	static bool STATIC_RegisterPerceptionStimuliSource(class UObject* WorldContextObject, class UClass* Sense, class AActor* Target);
	void OnPerceptionStimuliSourceEndPlay(class AActor* Actor, TEnumAsByte<EEndPlayReason> EndPlayReason);
	static class UClass* STATIC_GetSenseClassForStimulus(class UObject* WorldContextObject, const struct FAIStimulus& Stimulus);
};

// Class AIModule.AIResourceInterface
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
class UAIResourceInterface : public UInterface
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AIResourceInterface");
		return ptr;
	}


};

// Class AIModule.AIResource_Movement
// 0x0007 (FullSize[0x0038] - InheritedSize[0x0031])
// LastOffsetWithSize(0x0031)
class UAIResource_Movement : public UGameplayTaskResource
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AIResource_Movement");
		return ptr;
	}


};

// Class AIModule.AIResource_Logic
// 0x0007 (FullSize[0x0038] - InheritedSize[0x0031])
// LastOffsetWithSize(0x0031)
class UAIResource_Logic : public UGameplayTaskResource
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AIResource_Logic");
		return ptr;
	}


};

// Class AIModule.AISense
// 0x0018 (FullSize[0x0040] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
#define PADDING_09EB - 0x0000 // Minimum to subtract -> (0000)
class UAISense : public UObject
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_09EB, float,                                                                 DefaultExpirationAge);                                     // 0x0028(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0004 PADDING_09EB, EAISenseNotifyType,                                                    NotifyType);                                               // 0x002C(0x0001)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0008 PADDING_09EB, unsigned char,                                                         bWantsNewPawnNotification);                                // 0x0030(0x0001) BIT_FIELD (Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0008 PADDING_09EB, unsigned char,                                                         bAutoRegisterAllPawnsAsSources);                           // 0x0030(0x0001) BIT_FIELD (Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0010 PADDING_09EB, class UAIPerceptionSystem*,                                            PerceptionSystemInstance);                                 // 0x0038(0x0008)  (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISense");
		return ptr;
	}


};

// Class AIModule.AISense_Blueprint
// 0x0068 (FullSize[0x00A8] - InheritedSize[0x0040])
// LastOffsetWithSize(0x0040)
#define PADDING_09EC - 0x0000 // Minimum to subtract -> (0040)
class UAISense_Blueprint : public UAISense
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0040 PADDING_09EC, class UClass*,                                                         ListenerDataType);                                         // 0x0080(0x0008)  (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0048 PADDING_09EC, TArray<class UAIPerceptionComponent*>,                                 ListenerContainer);                                        // 0x0088(0x0010)  (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0058 PADDING_09EC, TArray<class UAISenseEvent*>,                                          UnprocessedEvents);                                        // 0x0098(0x0010)  (ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISense_Blueprint");
		return ptr;
	}


	float OnUpdate(TArray<class UAISenseEvent*> EventsToProcess);
	void OnListenerUpdated(class AActor* ActorListener, class UAIPerceptionComponent* PerceptionComponent);
	void OnListenerUnregistered(class AActor* ActorListener, class UAIPerceptionComponent* PerceptionComponent);
	void OnListenerRegistered(class AActor* ActorListener, class UAIPerceptionComponent* PerceptionComponent);
	void K2_OnNewPawn(class APawn* NewPawn);
	void GetAllListenerComponents(TArray<class UAIPerceptionComponent*>* ListenerComponents);
	void GetAllListenerActors(TArray<class AActor*>* ListenerActors);
};

// Class AIModule.AISense_Damage
// 0x0050 (FullSize[0x0090] - InheritedSize[0x0040])
// LastOffsetWithSize(0x0040)
#define PADDING_09ED - 0x0000 // Minimum to subtract -> (0040)
class UAISense_Damage : public UAISense
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0040 PADDING_09ED, TArray<struct FAIDamageEvent>,                                         RegisteredEvents);                                         // 0x0080(0x0010)  (ZeroConstructor, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISense_Damage");
		return ptr;
	}


	static void STATIC_ReportDamageEvent(class UObject* WorldContextObject, class AActor* DamagedActor, class AActor* Instigator, float DamageAmount, const struct FVector& EventLocation, const struct FVector& HitLocation);
};

// Class AIModule.AISense_Hearing
// 0x0054 (FullSize[0x0094] - InheritedSize[0x0040])
// LastOffsetWithSize(0x0040)
#define PADDING_09EE - 0x0000 // Minimum to subtract -> (0040)
class UAISense_Hearing : public UAISense
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0040 PADDING_09EE, TArray<struct FAINoiseEvent>,                                          NoiseEvents);                                              // 0x0080(0x0010)  (ZeroConstructor, Protected, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0050 PADDING_09EE, float,                                                                 SpeedOfSoundSq);                                           // 0x0090(0x0004)  (ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISense_Hearing");
		return ptr;
	}


	static void STATIC_ReportNoiseEvent(class UObject* WorldContextObject, const struct FVector& NoiseLocation, float Loudness, class AActor* Instigator, float MaxRange, const struct FName& Tag);
};

// Class AIModule.AISense_Prediction
// 0x0050 (FullSize[0x0090] - InheritedSize[0x0040])
// LastOffsetWithSize(0x0040)
#define PADDING_09EF - 0x0000 // Minimum to subtract -> (0040)
class UAISense_Prediction : public UAISense
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0040 PADDING_09EF, TArray<struct FAIPredictionEvent>,                                     RegisteredEvents);                                         // 0x0080(0x0010)  (ZeroConstructor, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISense_Prediction");
		return ptr;
	}


	static void STATIC_RequestPawnPredictionEvent(class APawn* Requestor, class AActor* PredictedActor, float PredictionTime);
	static void STATIC_RequestControllerPredictionEvent(class AAIController* Requestor, class AActor* PredictedActor, float PredictionTime);
};

// Class AIModule.AISense_Sight
// 0x0110 (FullSize[0x0150] - InheritedSize[0x0040])
// LastOffsetWithSize(0x0040)
#define PADDING_09F0 - 0x0000 // Minimum to subtract -> (00F0)
class UAISense_Sight : public UAISense
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x00F0 PADDING_09F0, int,                                                                   MaxTracesPerTick);                                         // 0x0130(0x0004)  (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x00F4 PADDING_09F0, int,                                                                   MinQueriesPerTimeSliceCheck);                              // 0x0134(0x0004)  (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x00F8 PADDING_09F0, double,                                                                MaxTimeSlicePerTick);                                      // 0x0138(0x0008)  (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0100 PADDING_09F0, float,                                                                 HighImportanceQueryDistanceThreshold);                     // 0x0140(0x0004)  (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0108 PADDING_09F0, float,                                                                 MaxQueryImportance);                                       // 0x0148(0x0004)  (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x010C PADDING_09F0, float,                                                                 SightLimitQueryImportance);                                // 0x014C(0x0004)  (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISense_Sight");
		return ptr;
	}


};

// Class AIModule.AISense_Team
// 0x0050 (FullSize[0x0090] - InheritedSize[0x0040])
// LastOffsetWithSize(0x0040)
#define PADDING_09F1 - 0x0000 // Minimum to subtract -> (0040)
class UAISense_Team : public UAISense
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0040 PADDING_09F1, TArray<struct FAITeamStimulusEvent>,                                   RegisteredEvents);                                         // 0x0080(0x0010)  (ZeroConstructor, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISense_Team");
		return ptr;
	}


};

// Class AIModule.AISense_Touch
// 0x0050 (FullSize[0x0090] - InheritedSize[0x0040])
// LastOffsetWithSize(0x0040)
#define PADDING_09F2 - 0x0000 // Minimum to subtract -> (0040)
class UAISense_Touch : public UAISense
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0040 PADDING_09F2, TArray<struct FAITouchEvent>,                                          RegisteredEvents);                                         // 0x0080(0x0010)  (ZeroConstructor, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISense_Touch");
		return ptr;
	}


};

// Class AIModule.AISenseBlueprintListener
// 0x0034 (FullSize[0x00F0] - InheritedSize[0x00BC])
// LastOffsetWithSize(0x00BC)
class UAISenseBlueprintListener : public UUserDefinedStruct
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISenseBlueprintListener");
		return ptr;
	}


};

// Class AIModule.AISenseConfig
// 0x0009 (FullSize[0x0031] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
#define PADDING_09F4 - 0x0000 // Minimum to subtract -> (0000)
class UAISenseConfig : public UObject
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_09F4, struct FColor,                                                         DebugColor);                                               // 0x0028(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0004 PADDING_09F4, float,                                                                 MaxAge);                                                   // 0x002C(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0008 PADDING_09F4, unsigned char,                                                         bStartsEnabled);                                           // 0x0030(0x0001) BIT_FIELD (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISenseConfig");
		return ptr;
	}


};

// Class AIModule.AISenseConfig_Blueprint
// 0x001F (FullSize[0x0050] - InheritedSize[0x0031])
// LastOffsetWithSize(0x0031)
#define PADDING_09F5 - 0x0000 // Minimum to subtract -> (0017)
class UAISenseConfig_Blueprint : public UAISenseConfig
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0017 PADDING_09F5, class UClass*,                                                         Implementation);                                           // 0x0048(0x0008)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISenseConfig_Blueprint");
		return ptr;
	}


};

// Class AIModule.AISenseConfig_Damage
// 0x001F (FullSize[0x0050] - InheritedSize[0x0031])
// LastOffsetWithSize(0x0031)
#define PADDING_09F6 - 0x0000 // Minimum to subtract -> (0017)
class UAISenseConfig_Damage : public UAISenseConfig
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0017 PADDING_09F6, class UClass*,                                                         Implementation);                                           // 0x0048(0x0008)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISenseConfig_Damage");
		return ptr;
	}


};

// Class AIModule.AISenseConfig_Hearing
// 0x002F (FullSize[0x0060] - InheritedSize[0x0031])
// LastOffsetWithSize(0x0031)
#define PADDING_09F7 - 0x0000 // Minimum to subtract -> (0017)
class UAISenseConfig_Hearing : public UAISenseConfig
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0017 PADDING_09F7, class UClass*,                                                         Implementation);                                           // 0x0048(0x0008)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x001F PADDING_09F7, float,                                                                 HearingRange);                                             // 0x0050(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0023 PADDING_09F7, float,                                                                 LoSHearingRange);                                          // 0x0054(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0027 PADDING_09F7, unsigned char,                                                         bUseLoSHearing);                                           // 0x0058(0x0001) BIT_FIELD (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x002B PADDING_09F7, struct FAISenseAffiliationFilter,                                      DetectionByAffiliation);                                   // 0x005C(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISenseConfig_Hearing");
		return ptr;
	}


};

// Class AIModule.AISenseConfig_Prediction
// 0x0017 (FullSize[0x0048] - InheritedSize[0x0031])
// LastOffsetWithSize(0x0031)
class UAISenseConfig_Prediction : public UAISenseConfig
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISenseConfig_Prediction");
		return ptr;
	}


};

// Class AIModule.AISenseConfig_Sight
// 0x0033 (FullSize[0x0064] - InheritedSize[0x0031])
// LastOffsetWithSize(0x0031)
#define PADDING_09F9 - 0x0000 // Minimum to subtract -> (0017)
class UAISenseConfig_Sight : public UAISenseConfig
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0017 PADDING_09F9, class UClass*,                                                         Implementation);                                           // 0x0048(0x0008)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x001F PADDING_09F9, float,                                                                 SightRadius);                                              // 0x0050(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0023 PADDING_09F9, float,                                                                 LoseSightRadius);                                          // 0x0054(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0027 PADDING_09F9, float,                                                                 PeripheralVisionAngleDegrees);                             // 0x0058(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x002B PADDING_09F9, struct FAISenseAffiliationFilter,                                      DetectionByAffiliation);                                   // 0x005C(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x002F PADDING_09F9, float,                                                                 AutoSuccessRangeFromLastSeenLocation);                     // 0x0060(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISenseConfig_Sight");
		return ptr;
	}


};

// Class AIModule.AISenseConfig_Team
// 0x0017 (FullSize[0x0048] - InheritedSize[0x0031])
// LastOffsetWithSize(0x0031)
class UAISenseConfig_Team : public UAISenseConfig
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISenseConfig_Team");
		return ptr;
	}


};

// Class AIModule.AISenseConfig_Touch
// 0x0017 (FullSize[0x0048] - InheritedSize[0x0031])
// LastOffsetWithSize(0x0031)
class UAISenseConfig_Touch : public UAISenseConfig
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISenseConfig_Touch");
		return ptr;
	}


};

// Class AIModule.AISenseEvent
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
class UAISenseEvent : public UObject
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISenseEvent");
		return ptr;
	}


};

// Class AIModule.AISenseEvent_Damage
// 0x0030 (FullSize[0x0058] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
#define PADDING_09FD - 0x0000 // Minimum to subtract -> (0000)
class UAISenseEvent_Damage : public UAISenseEvent
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_09FD, struct FAIDamageEvent,                                                 Event);                                                    // 0x0028(0x0030)  (Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISenseEvent_Damage");
		return ptr;
	}


};

// Class AIModule.AISenseEvent_Hearing
// 0x0030 (FullSize[0x0058] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
#define PADDING_09FE - 0x0000 // Minimum to subtract -> (0000)
class UAISenseEvent_Hearing : public UAISenseEvent
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_09FE, struct FAINoiseEvent,                                                  Event);                                                    // 0x0028(0x0030)  (Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISenseEvent_Hearing");
		return ptr;
	}


};

// Class AIModule.AISightTargetInterface
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
class UAISightTargetInterface : public UInterface
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISightTargetInterface");
		return ptr;
	}


};

// Class AIModule.AISystem
// 0x0087 (FullSize[0x00D8] - InheritedSize[0x0051])
// LastOffsetWithSize(0x0051)
#define PADDING_0A00 - 0x0000 // Minimum to subtract -> (0007)
class UAISystem : public UAISystemBase
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0007 PADDING_0A00, struct FSoftClassPath,                                                 PerceptionSystemClassName);                                // 0x0058(0x0018)  (Edit, ZeroConstructor, Config, GlobalConfig, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x001F PADDING_0A00, struct FSoftClassPath,                                                 HotSpotManagerClassName);                                  // 0x0070(0x0018)  (Edit, ZeroConstructor, Config, GlobalConfig, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0037 PADDING_0A00, float,                                                                 AcceptanceRadius);                                         // 0x0088(0x0004)  (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x003B PADDING_0A00, float,                                                                 PathfollowingRegularPathPointAcceptanceRadius);            // 0x008C(0x0004)  (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x003F PADDING_0A00, float,                                                                 PathfollowingNavLinkAcceptanceRadius);                     // 0x0090(0x0004)  (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0043 PADDING_0A00, bool,                                                                  bFinishMoveOnGoalOverlap);                                 // 0x0094(0x0001)  (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0044 PADDING_0A00, bool,                                                                  bAcceptPartialPaths);                                      // 0x0095(0x0001)  (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0045 PADDING_0A00, bool,                                                                  bAllowStrafing);                                           // 0x0096(0x0001)  (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0046 PADDING_0A00, bool,                                                                  bEnableBTAITasks);                                         // 0x0097(0x0001)  (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0047 PADDING_0A00, bool,                                                                  bAllowControllersAsEQSQuerier);                            // 0x0098(0x0001)  (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0048 PADDING_0A00, bool,                                                                  bEnableDebuggerPlugin);                                    // 0x0099(0x0001)  (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0049 PADDING_0A00, TEnumAsByte<ECollisionChannel>,                                        DefaultSightCollisionChannel);                             // 0x009A(0x0001)  (Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x004F PADDING_0A00, class UBehaviorTreeManager*,                                           BehaviorTreeManager);                                      // 0x00A0(0x0008)  (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0057 PADDING_0A00, class UEnvQueryManager*,                                               EnvironmentQueryManager);                                  // 0x00A8(0x0008)  (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x005F PADDING_0A00, class UAIPerceptionSystem*,                                            PerceptionSystem);                                         // 0x00B0(0x0008)  (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0067 PADDING_0A00, TArray<class UAIAsyncTaskBlueprintProxy*>,                             AllProxyObjects);                                          // 0x00B8(0x0010)  (ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0077 PADDING_0A00, class UAIHotSpotManager*,                                              HotSpotManager);                                           // 0x00C8(0x0008)  (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x007F PADDING_0A00, class UNavLocalGridManager*,                                           NavLocalGrids);                                            // 0x00D0(0x0008)  (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AISystem");
		return ptr;
	}


	void AILoggingVerbose();
	void AIIgnorePlayers();
};

// Class AIModule.AITask
// 0x0008 (FullSize[0x0070] - InheritedSize[0x0068])
// LastOffsetWithSize(0x0068)
#define PADDING_0A01 - 0x0000 // Minimum to subtract -> (0000)
class UAITask : public UGameplayTask
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_0A01, class AAIController*,                                                  OwnerController);                                          // 0x0068(0x0008)  (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AITask");
		return ptr;
	}


};

// Class AIModule.AITask_LockLogic
// 0x0000 (FullSize[0x0070] - InheritedSize[0x0070])
// LastOffsetWithSize(0x0070)
class UAITask_LockLogic : public UAITask
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AITask_LockLogic");
		return ptr;
	}


};

// Class AIModule.AITask_MoveTo
// 0x0060 (FullSize[0x00D0] - InheritedSize[0x0070])
// LastOffsetWithSize(0x0070)
#define PADDING_0A03 - 0x0000 // Minimum to subtract -> (0000)
class UAITask_MoveTo : public UAITask
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_0A03, struct FScriptMulticastDelegate,                                       OnRequestFailed);                                          // 0x0070(0x0010)  (ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0010 PADDING_0A03, struct FScriptMulticastDelegate,                                       OnMoveFinished);                                           // 0x0080(0x0010)  (ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0020 PADDING_0A03, struct FAIMoveRequest,                                                 MoveRequest);                                              // 0x0090(0x0040)  (Protected, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AITask_MoveTo");
		return ptr;
	}


	static class UAITask_MoveTo* STATIC_AIMoveTo(class AAIController* Controller, const struct FVector& GoalLocation, class AActor* GoalActor, float AcceptanceRadius, TEnumAsByte<EAIOptionFlag> StopOnOverlap, TEnumAsByte<EAIOptionFlag> AcceptPartialPath, bool bUsePathfinding, bool bLockAILogic, bool bUseContinuosGoalTracking, TEnumAsByte<EAIOptionFlag> ProjectGoalOnNavigation);
};

// Class AIModule.AITask_RunEQS
// 0x0000 (FullSize[0x0070] - InheritedSize[0x0070])
// LastOffsetWithSize(0x0070)
class UAITask_RunEQS : public UAITask
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.AITask_RunEQS");
		return ptr;
	}


	static class UAITask_RunEQS* STATIC_RunEQS(class AAIController* Controller, class UEnvQuery* QueryTemplate);
};

// Class AIModule.BehaviorTree
// 0x0030 (FullSize[0x0058] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
#define PADDING_0A05 - 0x0000 // Minimum to subtract -> (0000)
class UBehaviorTree : public UObject
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_0A05, class UBTCompositeNode*,                                               RootNode);                                                 // 0x0028(0x0008)  (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0008 PADDING_0A05, class UBlackboardData*,                                                BlackboardAsset);                                          // 0x0030(0x0008)  (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0010 PADDING_0A05, TArray<class UBTDecorator*>,                                           RootDecorators);                                           // 0x0038(0x0010)  (ZeroConstructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0020 PADDING_0A05, TArray<struct FBTDecoratorLogic>,                                      RootDecoratorOps);                                         // 0x0048(0x0010)  (ZeroConstructor, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.BehaviorTree");
		return ptr;
	}


};

// Class AIModule.BrainComponent
// 0x0028 (FullSize[0x00F0] - InheritedSize[0x00C8])
// LastOffsetWithSize(0x00C8)
#define PADDING_0A06 - 0x0000 // Minimum to subtract -> (0018)
class UBrainComponent : public UActorComponent
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0018 PADDING_0A06, class UBlackboardComponent*,                                           BlackboardComp);                                           // 0x00E0(0x0008)  (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0020 PADDING_0A06, class AAIController*,                                                  AIOwner);                                                  // 0x00E8(0x0008)  (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.BrainComponent");
		return ptr;
	}


	void StopLogic(const struct FString& Reason);
	void RestartLogic();
	bool IsRunning();
	bool IsPaused();
};

// Class AIModule.BehaviorTreeComponent
// 0x0078 (FullSize[0x0168] - InheritedSize[0x00F0])
// LastOffsetWithSize(0x00F0)
#define PADDING_0A07 - 0x0000 // Minimum to subtract -> (0068)
class UBehaviorTreeComponent : public UBrainComponent
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0068 PADDING_0A07, TArray<class UBTNode*>,                                                NodeInstances);                                            // 0x0158(0x0010)  (ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.BehaviorTreeComponent");
		return ptr;
	}


	void SetDynamicSubtree(const struct FGameplayTag& InjectTag, class UBehaviorTree* BehaviorAsset);
	float GetTagCooldownEndTime(const struct FGameplayTag& CooldownTag);
	void AddCooldownTagDuration(const struct FGameplayTag& CooldownTag, float CooldownDuration, bool bAddToExistingDuration);
};

// Class AIModule.BehaviorTreeManager
// 0x0028 (FullSize[0x0050] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
#define PADDING_0A08 - 0x0000 // Minimum to subtract -> (0000)
class UBehaviorTreeManager : public UObject
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_0A08, int,                                                                   MaxDebuggerSteps);                                         // 0x0028(0x0004)  (ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0008 PADDING_0A08, TArray<struct FBehaviorTreeTemplateInfo>,                              LoadedTemplates);                                          // 0x0030(0x0010)  (ZeroConstructor, Protected, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0018 PADDING_0A08, TArray<class UBehaviorTreeComponent*>,                                 ActiveComponents);                                         // 0x0040(0x0010)  (ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AIModule.BehaviorTreeManager");
		return ptr;
	}


};

