#pragma once

// Name: Sq, Version: b21


#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

/*!!HELPER_DEF!!*/

/*!!DEFINE!!*/

namespace UFT
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// WidgetBlueprintGeneratedClass BP_Tooltip_Vehicle.BP_Tooltip_Vehicle_C
// 0x00B0 (FullSize[0x02F0] - InheritedSize[0x0240])
// LastOffsetWithSize(0x0240)
#define PADDING_00BB - 0x0000 // Minimum to subtract -> (0000)
class UBP_Tooltip_Vehicle_C : public USQToolTipBaseWidget
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_00BB, struct FPointerToUberGraphFrame,                                       UberGraphFrame);                                           // 0x0240(0x0008)  (ZeroConstructor, Transient, DuplicateTransient)
		DEFINE_MEMBER_NNN(0x0008 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem);                                  // 0x0248(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0010 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_1);                              // 0x0250(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0018 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_2);                              // 0x0258(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0020 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_3);                              // 0x0260(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0028 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_4);                              // 0x0268(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0030 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_5);                              // 0x0270(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0038 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_6);                              // 0x0278(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0040 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_7);                              // 0x0280(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0048 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_8);                              // 0x0288(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0050 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_9);                              // 0x0290(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0058 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_10);                             // 0x0298(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0060 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_11);                             // 0x02A0(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0068 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_12);                             // 0x02A8(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0070 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_13);                             // 0x02B0(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0078 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_14);                             // 0x02B8(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0080 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_15);                             // 0x02C0(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0088 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_16);                             // 0x02C8(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0090 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_17);                             // 0x02D0(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0098 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_18);                             // 0x02D8(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x00A0 PADDING_00BB, class UUMG_VehicleSeatListItem_C*,                                     UMG_VehicleSeatListItem_C_19);                             // 0x02E0(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x00A8 PADDING_00BB, class UVerticalBox*,                                                   VerticalBox_Occupants);                                    // 0x02E8(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("WidgetBlueprintGeneratedClass BP_Tooltip_Vehicle.BP_Tooltip_Vehicle_C");
		return ptr;
	}


	void Refresh_Seat_Info();
	void Get_Vehicle(class ASQVehicle** AsSQVehicle);
	void Construct();
	void ExecuteUbergraph_BP_Tooltip_Vehicle(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
