#pragma once

// Name: Sq, Version: b21


#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

/*!!HELPER_DEF!!*/

/*!!DEFINE!!*/

namespace UFT
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class UMG.Visual
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
class UVisual : public UObject
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.Visual");
		return ptr;
	}


};

// Class UMG.Widget
// 0x00E0 (FullSize[0x0108] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
#define PADDING_0957 - 0x0000 // Minimum to subtract -> (0000)
class UWidget : public UVisual
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_0957, class UPanelSlot*,                                                     Slot);                                                     // 0x0028(0x0008)  (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, TextExportTransient, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0008 PADDING_0957, struct FScriptDelegate,                                                bIsEnabledDelegate);                                       // 0x0030(0x0010)  (ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0018 PADDING_0957, struct FText,                                                          ToolTipText);                                              // 0x0040(0x0018)  (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0030 PADDING_0957, struct FScriptDelegate,                                                ToolTipTextDelegate);                                      // 0x0058(0x0010)  (ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0040 PADDING_0957, class UWidget*,                                                        ToolTipWidget);                                            // 0x0068(0x0008)  (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0048 PADDING_0957, struct FScriptDelegate,                                                ToolTipWidgetDelegate);                                    // 0x0070(0x0010)  (ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0058 PADDING_0957, struct FScriptDelegate,                                                VisibilityDelegate);                                       // 0x0080(0x0010)  (ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0068 PADDING_0957, struct FWidgetTransform,                                               RenderTransform);                                          // 0x0090(0x001C)  (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0084 PADDING_0957, struct FVector2D,                                                      RenderTransformPivot);                                     // 0x00AC(0x0008)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x008C PADDING_0957, unsigned char,                                                         bIsVariable);                                              // 0x00B4(0x0001) BIT_FIELD (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x008C PADDING_0957, unsigned char,                                                         bCreatedByConstructionScript);                             // 0x00B4(0x0001) BIT_FIELD (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x008C PADDING_0957, unsigned char,                                                         bIsEnabled);                                               // 0x00B4(0x0001) BIT_FIELD (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x008C PADDING_0957, unsigned char,                                                         bOverride_Cursor);                                         // 0x00B4(0x0001) BIT_FIELD (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0090 PADDING_0957, class USlateAccessibleWidgetData*,                                     AccessibleWidgetData);                                     // 0x00B8(0x0008)  (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		DEFINE_MEMBER_NNN(0x0098 PADDING_0957, unsigned char,                                                         bIsVolatile);                                              // 0x00C0(0x0001) BIT_FIELD (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0099 PADDING_0957, TEnumAsByte<EMouseCursor>,                                             cursor);                                                   // 0x00C1(0x0001)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x009A PADDING_0957, EWidgetClipping,                                                       Clipping);                                                 // 0x00C2(0x0001)  (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x009B PADDING_0957, ESlateVisibility,                                                      Visibility);                                               // 0x00C3(0x0001)  (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x009C PADDING_0957, float,                                                                 RenderOpacity);                                            // 0x00C4(0x0004)  (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00A0 PADDING_0957, class UWidgetNavigation*,                                              Navigation);                                               // 0x00C8(0x0008)  (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00A8 PADDING_0957, EFlowDirectionPreference,                                              FlowDirectionPreference);                                  // 0x00D0(0x0001)  (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00D0 PADDING_0957, TArray<class UPropertyBinding*>,                                       NativeBindings);                                           // 0x00F8(0x0010)  (ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.Widget");
		return ptr;
	}


	void SetVisibility(ESlateVisibility InVisibility);
	void SetUserFocus(class APlayerController* PlayerController);
	void SetToolTipText(const struct FText& InToolTipText);
	void SetToolTip(class UWidget* Widget);
	void SetRenderTranslation(const struct FVector2D& Translation);
	void SetRenderTransformPivot(const struct FVector2D& Pivot);
	void SetRenderTransformAngle(float Angle);
	void SetRenderTransform(const struct FWidgetTransform& InTransform);
	void SetRenderShear(const struct FVector2D& Shear);
	void SetRenderScale(const struct FVector2D& Scale);
	void SetRenderOpacity(float InOpacity);
	void SetNavigationRule(EUINavigation Direction, EUINavigationRule Rule, const struct FName& WidgetToFocus);
	void SetKeyboardFocus();
	void SetIsEnabled(bool bInIsEnabled);
	void SetCursor(TEnumAsByte<EMouseCursor> InCursor);
	void SetClipping(EWidgetClipping InClipping);
	void SetAllNavigationRules(EUINavigationRule Rule, const struct FName& WidgetToFocus);
	void ResetCursor();
	void RemoveFromParent();
	struct FEventReply OnReply__DelegateSignature();
	struct FEventReply OnPointerEvent__DelegateSignature(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	bool IsVisible();
	bool IsHovered();
	void InvalidateLayoutAndVolatility();
	bool HasUserFocusedDescendants(class APlayerController* PlayerController);
	bool HasUserFocus(class APlayerController* PlayerController);
	bool HasMouseCaptureByUser(int UserIndex, int PointerIndex);
	bool HasMouseCapture();
	bool HasKeyboardFocus();
	bool HasFocusedDescendants();
	bool HasAnyUserFocus();
	class UWidget* GetWidget__DelegateSignature();
	ESlateVisibility GetVisibility();
	struct FText GetText__DelegateSignature();
	ESlateVisibility GetSlateVisibility__DelegateSignature();
	struct FSlateColor GetSlateColor__DelegateSignature();
	struct FSlateBrush GetSlateBrush__DelegateSignature();
	float GetRenderTransformAngle();
	float GetRenderOpacity();
	class UPanelWidget* GetParent();
	class APlayerController* GetOwningPlayer();
	class ULocalPlayer* GetOwningLocalPlayer();
	TEnumAsByte<EMouseCursor> GetMouseCursor__DelegateSignature();
	struct FLinearColor GetLinearColor__DelegateSignature();
	bool GetIsEnabled();
	int GetInt32__DelegateSignature();
	class UGameInstance* GetGameInstance();
	float GetFloat__DelegateSignature();
	struct FVector2D GetDesiredSize();
	EWidgetClipping GetClipping();
	ECheckBoxState GetCheckBoxState__DelegateSignature();
	struct FGeometry GetCachedGeometry();
	bool GetBool__DelegateSignature();
	class UWidget* GenerateWidgetForString__DelegateSignature(const struct FString& Item);
	class UWidget* GenerateWidgetForObject__DelegateSignature(class UObject* Item);
	void ForceVolatile(bool bForce);
	void ForceLayoutPrepass();
};

// Class UMG.PanelWidget
// 0x0010 (FullSize[0x0118] - InheritedSize[0x0108])
// LastOffsetWithSize(0x0108)
#define PADDING_0958 - 0x0000 // Minimum to subtract -> (0000)
class UPanelWidget : public UWidget
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_0958, TArray<class UPanelSlot*>,                                             Slots);                                                    // 0x0108(0x0010)  (ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.PanelWidget");
		return ptr;
	}


	bool RemoveChildAt(int Index);
	bool RemoveChild(class UWidget* Content);
	bool HasChild(class UWidget* Content);
	bool HasAnyChildren();
	int GetChildrenCount();
	int GetChildIndex(class UWidget* Content);
	class UWidget* GetChildAt(int Index);
	TArray<class UWidget*> GetAllChildren();
	void ClearChildren();
	class UPanelSlot* AddChild(class UWidget* Content);
};

// Class UMG.CanvasPanel
// 0x0008 (FullSize[0x0120] - InheritedSize[0x0118])
// LastOffsetWithSize(0x0118)
class UCanvasPanel : public UPanelWidget
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.CanvasPanel");
		return ptr;
	}


	class UCanvasPanelSlot* AddChildToCanvas(class UWidget* Content);
};

// Class UMG.UserWidget
// 0x00D8 (FullSize[0x01E0] - InheritedSize[0x0108])
// LastOffsetWithSize(0x0108)
#define PADDING_095A - 0x0000 // Minimum to subtract -> (0008)
class UUserWidget : public UWidget
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0008 PADDING_095A, struct FLinearColor,                                                   ColorAndOpacity);                                          // 0x0110(0x0010)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0018 PADDING_095A, struct FScriptDelegate,                                                ColorAndOpacityDelegate);                                  // 0x0120(0x0010)  (ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0028 PADDING_095A, struct FSlateColor,                                                    ForegroundColor);                                          // 0x0130(0x0028)  (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0050 PADDING_095A, struct FScriptDelegate,                                                ForegroundColorDelegate);                                  // 0x0158(0x0010)  (ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0060 PADDING_095A, struct FMargin,                                                        Padding);                                                  // 0x0168(0x0010)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0070 PADDING_095A, TArray<class UUMGSequencePlayer*>,                                     ActiveSequencePlayers);                                    // 0x0178(0x0010)  (ZeroConstructor, Transient, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0080 PADDING_095A, TArray<class UUMGSequencePlayer*>,                                     StoppedSequencePlayers);                                   // 0x0188(0x0010)  (ZeroConstructor, Transient, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0090 PADDING_095A, TArray<struct FNamedSlotBinding>,                                      NamedSlotBindings);                                        // 0x0198(0x0010)  (ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
		DEFINE_MEMBER_NNN(0x00A0 PADDING_095A, class UWidgetTree*,                                                    WidgetTree);                                               // 0x01A8(0x0008)  (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, TextExportTransient, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00A8 PADDING_095A, int,                                                                   Priority);                                                 // 0x01B0(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00AC PADDING_095A, unsigned char,                                                         bSupportsKeyboardFocus);                                   // 0x01B4(0x0001) BIT_FIELD (Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00AC PADDING_095A, unsigned char,                                                         bIsFocusable);                                             // 0x01B4(0x0001) BIT_FIELD (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00AC PADDING_095A, unsigned char,                                                         bStopAction);                                              // 0x01B4(0x0001) BIT_FIELD (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00AC PADDING_095A, unsigned char,                                                         bHasScriptImplementedTick);                                // 0x01B4(0x0001) BIT_FIELD (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00AC PADDING_095A, unsigned char,                                                         bHasScriptImplementedPaint);                               // 0x01B4(0x0001) BIT_FIELD (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00AC PADDING_095A, unsigned char,                                                         bCookedWidgetTree);                                        // 0x01B4(0x0001) BIT_FIELD (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00B8 PADDING_095A, EWidgetTickFrequency,                                                  TickFrequency);                                            // 0x01C0(0x0001)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		DEFINE_MEMBER_NNN(0x00C0 PADDING_095A, class UInputComponent*,                                                InputComponent);                                           // 0x01C8(0x0008)  (ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x00C8 PADDING_095A, TArray<struct FAnimationEventBinding>,                                 AnimationCallbacks);                                       // 0x01D0(0x0010)  (ZeroConstructor, Transient, DuplicateTransient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.UserWidget");
		return ptr;
	}


	void UnregisterInputComponent();
	void UnbindFromAnimationStarted(class UWidgetAnimation* Animation, const struct FScriptDelegate& Delegate);
	void UnbindFromAnimationFinished(class UWidgetAnimation* Animation, const struct FScriptDelegate& Delegate);
	void UnbindAllFromAnimationStarted(class UWidgetAnimation* Animation);
	void UnbindAllFromAnimationFinished(class UWidgetAnimation* Animation);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void StopListeningForInputAction(const struct FName& ActionName, TEnumAsByte<EInputEvent> EventType);
	void StopListeningForAllInputActions();
	void StopAnimationsAndLatentActions();
	void StopAnimation(class UWidgetAnimation* InAnimation);
	void StopAllAnimations();
	void SetPositionInViewport(const struct FVector2D& Position, bool bRemoveDPIScale);
	void SetPlaybackSpeed(class UWidgetAnimation* InAnimation, float PlaybackSpeed);
	void SetPadding(const struct FMargin& InPadding);
	void SetOwningPlayer(class APlayerController* LocalPlayerController);
	void SetNumLoopsToPlay(class UWidgetAnimation* InAnimation, int NumLoopsToPlay);
	void SetInputActionPriority(int NewPriority);
	void SetInputActionBlocking(bool bShouldBlock);
	void SetForegroundColor(const struct FSlateColor& InForegroundColor);
	void SetDesiredSizeInViewport(const struct FVector2D& Size);
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity);
	void SetAnchorsInViewport(const struct FAnchors& Anchors);
	void SetAlignmentInViewport(const struct FVector2D& Alignment);
	void ReverseAnimation(class UWidgetAnimation* InAnimation);
	void RemoveFromViewport();
	void RegisterInputComponent();
	void PreConstruct(bool IsDesignTime);
	void PlaySound(class USoundBase* SoundToPlay);
	class UUMGSequencePlayer* PlayAnimationTimeRange(class UWidgetAnimation* InAnimation, float StartAtTime, float EndAtTime, int NumLoopsToPlay, TEnumAsByte<EUMGSequencePlayMode> PlayMode, float PlaybackSpeed);
	class UUMGSequencePlayer* PlayAnimationReverse(class UWidgetAnimation* InAnimation, float PlaybackSpeed);
	class UUMGSequencePlayer* PlayAnimationForward(class UWidgetAnimation* InAnimation, float PlaybackSpeed);
	class UUMGSequencePlayer* PlayAnimation(class UWidgetAnimation* InAnimation, float StartAtTime, int NumLoopsToPlay, TEnumAsByte<EUMGSequencePlayMode> PlayMode, float PlaybackSpeed);
	float PauseAnimation(class UWidgetAnimation* InAnimation);
	struct FEventReply OnTouchStarted(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	struct FEventReply OnTouchMoved(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	struct FEventReply OnTouchGesture(const struct FGeometry& MyGeometry, const struct FPointerEvent& GestureEvent);
	struct FEventReply OnTouchForceChanged(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	struct FEventReply OnTouchEnded(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnPaint(struct FPaintContext* Context);
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseCaptureLost();
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonDoubleClick(const struct FGeometry& InMyGeometry, const struct FPointerEvent& InMouseEvent);
	struct FEventReply OnMotionDetected(const struct FGeometry& MyGeometry, const struct FMotionEvent& InMotionEvent);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnKeyChar(const struct FGeometry& MyGeometry, const struct FCharacterEvent& InCharacterEvent);
	void OnInitialized();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	bool OnDragOver(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnDragLeave(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnDragEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);
	void OnDragCancelled(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnAnimationStarted(class UWidgetAnimation* Animation);
	void OnAnimationFinished(class UWidgetAnimation* Animation);
	struct FEventReply OnAnalogValueChanged(const struct FGeometry& MyGeometry, const struct FAnalogInputEvent& InAnalogInputEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void ListenForInputAction(const struct FName& ActionName, TEnumAsByte<EInputEvent> EventType, bool bConsume, const struct FScriptDelegate& Callback);
	bool IsPlayingAnimation();
	bool IsListeningForInputAction(const struct FName& ActionName);
	bool IsInViewport();
	bool IsInteractable();
	bool IsAnyAnimationPlaying();
	bool IsAnimationPlayingForward(class UWidgetAnimation* InAnimation);
	bool IsAnimationPlaying(class UWidgetAnimation* InAnimation);
	class APawn* GetOwningPlayerPawn();
	bool GetIsVisible();
	float GetAnimationCurrentTime(class UWidgetAnimation* InAnimation);
	struct FAnchors GetAnchorsInViewport();
	struct FVector2D GetAlignmentInViewport();
	void Destruct();
	void Construct();
	void CancelLatentActions();
	void BindToAnimationStarted(class UWidgetAnimation* Animation, const struct FScriptDelegate& Delegate);
	void BindToAnimationFinished(class UWidgetAnimation* Animation, const struct FScriptDelegate& Delegate);
	void BindToAnimationEvent(class UWidgetAnimation* Animation, const struct FScriptDelegate& Delegate, EWidgetAnimationEvent AnimationEvent, const struct FName& UserTag);
	void AddToViewport(int ZOrder);
	bool AddToPlayerScreen(int ZOrder);
};

// Class UMG.ContentWidget
// 0x0008 (FullSize[0x0120] - InheritedSize[0x0118])
// LastOffsetWithSize(0x0118)
class UContentWidget : public UPanelWidget
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.ContentWidget");
		return ptr;
	}


	class UPanelSlot* SetContent(class UWidget* Content);
	class UPanelSlot* GetContentSlot();
	class UWidget* GetContent();
};

// Class UMG.Button
// 0x02F8 (FullSize[0x0418] - InheritedSize[0x0120])
// LastOffsetWithSize(0x0118)
#define PADDING_095C - 0x0000 // Minimum to subtract -> (0008)
class UButton : public UContentWidget
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0008 PADDING_095C, class USlateWidgetStyleAsset*,                                         Style);                                                    // 0x0120(0x0008)  (ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0010 PADDING_095C, struct FButtonStyle,                                                   WidgetStyle);                                              // 0x0128(0x0278)  (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0288 PADDING_095C, struct FLinearColor,                                                   ColorAndOpacity);                                          // 0x03A0(0x0010)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0298 PADDING_095C, struct FLinearColor,                                                   BackgroundColor);                                          // 0x03B0(0x0010)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x02A8 PADDING_095C, TEnumAsByte<EButtonClickMethod>,                                       ClickMethod);                                              // 0x03C0(0x0001)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x02A9 PADDING_095C, TEnumAsByte<EButtonTouchMethod>,                                       TouchMethod);                                              // 0x03C1(0x0001)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x02AA PADDING_095C, TEnumAsByte<EButtonPressMethod>,                                       PressMethod);                                              // 0x03C2(0x0001)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x02AB PADDING_095C, bool,                                                                  IsFocusable);                                              // 0x03C3(0x0001)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x02B0 PADDING_095C, struct FScriptMulticastDelegate,                                       OnClicked);                                                // 0x03C8(0x0010)  (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x02C0 PADDING_095C, struct FScriptMulticastDelegate,                                       OnPressed);                                                // 0x03D8(0x0010)  (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x02D0 PADDING_095C, struct FScriptMulticastDelegate,                                       OnReleased);                                               // 0x03E8(0x0010)  (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x02E0 PADDING_095C, struct FScriptMulticastDelegate,                                       OnHovered);                                                // 0x03F8(0x0010)  (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x02F0 PADDING_095C, struct FScriptMulticastDelegate,                                       OnUnhovered);                                              // 0x0408(0x0010)  (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.Button");
		return ptr;
	}


	void SetTouchMethod(TEnumAsByte<EButtonTouchMethod> InTouchMethod);
	void SetStyle(const struct FButtonStyle& InStyle);
	void SetPressMethod(TEnumAsByte<EButtonPressMethod> InPressMethod);
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity);
	void SetClickMethod(TEnumAsByte<EButtonClickMethod> InClickMethod);
	void SetBackgroundColor(const struct FLinearColor& InBackgroundColor);
	bool IsPressed();
};

// Class UMG.Image
// 0x00CC (FullSize[0x01D4] - InheritedSize[0x0108])
// LastOffsetWithSize(0x0108)
#define PADDING_095D - 0x0000 // Minimum to subtract -> (0000)
class UImage : public UWidget
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_095D, struct FSlateBrush,                                                    Brush);                                                    // 0x0108(0x0088)  (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0088 PADDING_095D, struct FScriptDelegate,                                                BrushDelegate);                                            // 0x0190(0x0010)  (ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0098 PADDING_095D, struct FLinearColor,                                                   ColorAndOpacity);                                          // 0x01A0(0x0010)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00A8 PADDING_095D, struct FScriptDelegate,                                                ColorAndOpacityDelegate);                                  // 0x01B0(0x0010)  (ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00B8 PADDING_095D, bool,                                                                  bFlipForRightToLeftFlowDirection);                         // 0x01C0(0x0001)  (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00BC PADDING_095D, struct FScriptDelegate,                                                OnMouseButtonDownEvent);                                   // 0x01C4(0x0010)  (Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.Image");
		return ptr;
	}


	void SetOpacity(float InOpacity);
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity);
	void SetBrushTintColor(const struct FSlateColor& TintColor);
	void SetBrushSize(const struct FVector2D& DesiredSize);
	void SetBrushResourceObject(class UObject* ResourceObject);
	void SetBrushFromTextureDynamic(class UTexture2DDynamic* Texture, bool bMatchSize);
	void SetBrushFromTexture(class UTexture2D* Texture, bool bMatchSize);
	void SetBrushFromSoftTexture(bool bMatchSize);
	void SetBrushFromSoftMaterial();
	void SetBrushFromMaterial(class UMaterialInterface* Material);
	void SetBrushFromAtlasInterface(const TScriptInterface<class USlateTextureAtlasInterface>& AtlasRegion, bool bMatchSize);
	void SetBrushFromAsset(class USlateBrushAsset* Asset);
	void SetBrush(const struct FSlateBrush& InBrush);
	class UMaterialInstanceDynamic* GetDynamicMaterial();
};

// Class UMG.AsyncTaskDownloadImage
// 0x0028 (FullSize[0x0050] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
#define PADDING_095E - 0x0000 // Minimum to subtract -> (0008)
class UAsyncTaskDownloadImage : public UBlueprintAsyncActionBase
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0008 PADDING_095E, struct FScriptMulticastDelegate,                                       OnSuccess);                                                // 0x0030(0x0010)  (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0018 PADDING_095E, struct FScriptMulticastDelegate,                                       OnFail);                                                   // 0x0040(0x0010)  (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.AsyncTaskDownloadImage");
		return ptr;
	}


	static class UAsyncTaskDownloadImage* STATIC_DownloadImage(const struct FString& URL);
};

// Class UMG.BackgroundBlur
// 0x00A8 (FullSize[0x01C8] - InheritedSize[0x0120])
// LastOffsetWithSize(0x0118)
#define PADDING_095F - 0x0000 // Minimum to subtract -> (0008)
class UBackgroundBlur : public UContentWidget
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0008 PADDING_095F, struct FMargin,                                                        Padding);                                                  // 0x0120(0x0010)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0018 PADDING_095F, TEnumAsByte<EHorizontalAlignment>,                                     HorizontalAlignment);                                      // 0x0130(0x0001)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0019 PADDING_095F, TEnumAsByte<EVerticalAlignment>,                                       VerticalAlignment);                                        // 0x0131(0x0001)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x001A PADDING_095F, bool,                                                                  bApplyAlphaToBlur);                                        // 0x0132(0x0001)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x001C PADDING_095F, float,                                                                 BlurStrength);                                             // 0x0134(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0020 PADDING_095F, bool,                                                                  bOverrideAutoRadiusCalculation);                           // 0x0138(0x0001)  (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0024 PADDING_095F, int,                                                                   BlurRadius);                                               // 0x013C(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0028 PADDING_095F, struct FSlateBrush,                                                    LowQualityFallbackBrush);                                  // 0x0140(0x0088)  (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.BackgroundBlur");
		return ptr;
	}


	void SetVerticalAlignment(TEnumAsByte<EVerticalAlignment> InVerticalAlignment);
	void SetPadding(const struct FMargin& InPadding);
	void SetLowQualityFallbackBrush(const struct FSlateBrush& InBrush);
	void SetHorizontalAlignment(TEnumAsByte<EHorizontalAlignment> InHorizontalAlignment);
	void SetBlurStrength(float InStrength);
	void SetBlurRadius(int InBlurRadius);
	void SetApplyAlphaToBlur(bool bInApplyAlphaToBlur);
};

// Class UMG.PanelSlot
// 0x0010 (FullSize[0x0038] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
#define PADDING_0960 - 0x0000 // Minimum to subtract -> (0000)
class UPanelSlot : public UVisual
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_0960, class UPanelWidget*,                                                   Parent);                                                   // 0x0028(0x0008)  (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0008 PADDING_0960, class UWidget*,                                                        Content);                                                  // 0x0030(0x0008)  (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.PanelSlot");
		return ptr;
	}


};

// Class UMG.BackgroundBlurSlot
// 0x0012 (FullSize[0x004A] - InheritedSize[0x0038])
// LastOffsetWithSize(0x0038)
#define PADDING_0961 - 0x0000 // Minimum to subtract -> (0000)
class UBackgroundBlurSlot : public UPanelSlot
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_0961, struct FMargin,                                                        Padding);                                                  // 0x0038(0x0010)  (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0010 PADDING_0961, TEnumAsByte<EHorizontalAlignment>,                                     HorizontalAlignment);                                      // 0x0048(0x0001)  (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0011 PADDING_0961, TEnumAsByte<EVerticalAlignment>,                                       VerticalAlignment);                                        // 0x0049(0x0001)  (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.BackgroundBlurSlot");
		return ptr;
	}


	void SetVerticalAlignment(TEnumAsByte<EVerticalAlignment> InVerticalAlignment);
	void SetPadding(const struct FMargin& InPadding);
	void SetHorizontalAlignment(TEnumAsByte<EHorizontalAlignment> InHorizontalAlignment);
};

// Class UMG.PropertyBinding
// 0x0040 (FullSize[0x0068] - InheritedSize[0x0028])
// LastOffsetWithSize(0x0028)
#define PADDING_0962 - 0x0000 // Minimum to subtract -> (0000)
class UPropertyBinding : public UObject
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_0962, TWeakObjectPtr<class UObject>,                                         SourceObject);                                             // 0x0028(0x0008)  (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0008 PADDING_0962, struct FDynamicPropertyPath,                                           SourcePath);                                               // 0x0030(0x0030)  (NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0038 PADDING_0962, struct FName,                                                          DestinationProperty);                                      // 0x0060(0x0008)  (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.PropertyBinding");
		return ptr;
	}


};

// Class UMG.BoolBinding
// 0x0000 (FullSize[0x0068] - InheritedSize[0x0068])
// LastOffsetWithSize(0x0068)
class UBoolBinding : public UPropertyBinding
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.BoolBinding");
		return ptr;
	}


	bool GetValue();
};

// Class UMG.Border
// 0x013C (FullSize[0x025C] - InheritedSize[0x0120])
// LastOffsetWithSize(0x0118)
#define PADDING_0964 - 0x0000 // Minimum to subtract -> (0008)
class UBorder : public UContentWidget
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0008 PADDING_0964, TEnumAsByte<EHorizontalAlignment>,                                     HorizontalAlignment);                                      // 0x0120(0x0001)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0009 PADDING_0964, TEnumAsByte<EVerticalAlignment>,                                       VerticalAlignment);                                        // 0x0121(0x0001)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x000A PADDING_0964, unsigned char,                                                         bShowEffectWhenDisabled);                                  // 0x0122(0x0001) BIT_FIELD (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x000C PADDING_0964, struct FLinearColor,                                                   ContentColorAndOpacity);                                   // 0x0124(0x0010)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x001C PADDING_0964, struct FScriptDelegate,                                                ContentColorAndOpacityDelegate);                           // 0x0134(0x0010)  (ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x002C PADDING_0964, struct FMargin,                                                        Padding);                                                  // 0x0144(0x0010)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0040 PADDING_0964, struct FSlateBrush,                                                    Background);                                               // 0x0158(0x0088)  (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00C8 PADDING_0964, struct FScriptDelegate,                                                BackgroundDelegate);                                       // 0x01E0(0x0010)  (ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00D8 PADDING_0964, struct FLinearColor,                                                   BrushColor);                                               // 0x01F0(0x0010)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00E8 PADDING_0964, struct FScriptDelegate,                                                BrushColorDelegate);                                       // 0x0200(0x0010)  (ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x00F8 PADDING_0964, struct FVector2D,                                                      DesiredSizeScale);                                         // 0x0210(0x0008)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0100 PADDING_0964, bool,                                                                  bFlipForRightToLeftFlowDirection);                         // 0x0218(0x0001)  (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0104 PADDING_0964, struct FScriptDelegate,                                                OnMouseButtonDownEvent);                                   // 0x021C(0x0010)  (Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0114 PADDING_0964, struct FScriptDelegate,                                                OnMouseButtonUpEvent);                                     // 0x022C(0x0010)  (Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0124 PADDING_0964, struct FScriptDelegate,                                                OnMouseMoveEvent);                                         // 0x023C(0x0010)  (Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0134 PADDING_0964, struct FScriptDelegate,                                                OnMouseDoubleClickEvent);                                  // 0x024C(0x0010)  (Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.Border");
		return ptr;
	}


	void SetVerticalAlignment(TEnumAsByte<EVerticalAlignment> InVerticalAlignment);
	void SetPadding(const struct FMargin& InPadding);
	void SetHorizontalAlignment(TEnumAsByte<EHorizontalAlignment> InHorizontalAlignment);
	void SetDesiredSizeScale(const struct FVector2D& InScale);
	void SetContentColorAndOpacity(const struct FLinearColor& InContentColorAndOpacity);
	void SetBrushFromTexture(class UTexture2D* Texture);
	void SetBrushFromMaterial(class UMaterialInterface* Material);
	void SetBrushFromAsset(class USlateBrushAsset* Asset);
	void SetBrushColor(const struct FLinearColor& InBrushColor);
	void SetBrush(const struct FSlateBrush& InBrush);
	class UMaterialInstanceDynamic* GetDynamicMaterial();
};

// Class UMG.BorderSlot
// 0x0012 (FullSize[0x004A] - InheritedSize[0x0038])
// LastOffsetWithSize(0x0038)
#define PADDING_0965 - 0x0000 // Minimum to subtract -> (0000)
class UBorderSlot : public UPanelSlot
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_0965, struct FMargin,                                                        Padding);                                                  // 0x0038(0x0010)  (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0010 PADDING_0965, TEnumAsByte<EHorizontalAlignment>,                                     HorizontalAlignment);                                      // 0x0048(0x0001)  (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
		DEFINE_MEMBER_NNN(0x0011 PADDING_0965, TEnumAsByte<EVerticalAlignment>,                                       VerticalAlignment);                                        // 0x0049(0x0001)  (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.BorderSlot");
		return ptr;
	}


	void SetVerticalAlignment(TEnumAsByte<EVerticalAlignment> InVerticalAlignment);
	void SetPadding(const struct FMargin& InPadding);
	void SetHorizontalAlignment(TEnumAsByte<EHorizontalAlignment> InHorizontalAlignment);
};

// Class UMG.BrushBinding
// 0x0000 (FullSize[0x0068] - InheritedSize[0x0068])
// LastOffsetWithSize(0x0068)
class UBrushBinding : public UPropertyBinding
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.BrushBinding");
		return ptr;
	}


	struct FSlateBrush GetValue();
};

// Class UMG.ButtonSlot
// 0x0012 (FullSize[0x004A] - InheritedSize[0x0038])
// LastOffsetWithSize(0x0038)
#define PADDING_0967 - 0x0000 // Minimum to subtract -> (0000)
class UButtonSlot : public UPanelSlot
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_0967, struct FMargin,                                                        Padding);                                                  // 0x0038(0x0010)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0010 PADDING_0967, TEnumAsByte<EHorizontalAlignment>,                                     HorizontalAlignment);                                      // 0x0048(0x0001)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0011 PADDING_0967, TEnumAsByte<EVerticalAlignment>,                                       VerticalAlignment);                                        // 0x0049(0x0001)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.ButtonSlot");
		return ptr;
	}


	void SetVerticalAlignment(TEnumAsByte<EVerticalAlignment> InVerticalAlignment);
	void SetPadding(const struct FMargin& InPadding);
	void SetHorizontalAlignment(TEnumAsByte<EHorizontalAlignment> InHorizontalAlignment);
};

// Class UMG.CanvasPanelSlot
// 0x0030 (FullSize[0x0068] - InheritedSize[0x0038])
// LastOffsetWithSize(0x0038)
#define PADDING_0968 - 0x0000 // Minimum to subtract -> (0000)
class UCanvasPanelSlot : public UPanelSlot
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_0968, struct FAnchorData,                                                    LayoutData);                                               // 0x0038(0x0028)  (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0028 PADDING_0968, bool,                                                                  bAutoSize);                                                // 0x0060(0x0001)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x002C PADDING_0968, int,                                                                   ZOrder);                                                   // 0x0064(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.CanvasPanelSlot");
		return ptr;
	}


	void SetZOrder(int InZOrder);
	void SetSize(const struct FVector2D& InSize);
	void SetPosition(const struct FVector2D& InPosition);
	void SetOffsets(const struct FMargin& InOffset);
	void SetMinimum(const struct FVector2D& InMinimumAnchors);
	void SetMaximum(const struct FVector2D& InMaximumAnchors);
	void SetLayout(const struct FAnchorData& InLayoutData);
	void SetAutoSize(bool InbAutoSize);
	void SetAnchors(const struct FAnchors& InAnchors);
	void SetAlignment(const struct FVector2D& InAlignment);
	int GetZOrder();
	struct FVector2D GetSize();
	struct FVector2D GetPosition();
	struct FMargin GetOffsets();
	struct FAnchorData GetLayout();
	bool GetAutoSize();
	struct FAnchors GetAnchors();
	struct FVector2D GetAlignment();
};

// Class UMG.CheckBox
// 0x0640 (FullSize[0x0760] - InheritedSize[0x0120])
// LastOffsetWithSize(0x0118)
#define PADDING_0969 - 0x0000 // Minimum to subtract -> (0008)
class UCheckBox : public UContentWidget
{
public:
	union
	{
		DEFINE_MEMBER_NNN(0x0008 PADDING_0969, ECheckBoxState,                                                        CheckedState);                                             // 0x0120(0x0001)  (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x000C PADDING_0969, struct FScriptDelegate,                                                CheckedStateDelegate);                                     // 0x0124(0x0010)  (ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0020 PADDING_0969, struct FCheckBoxStyle,                                                 WidgetStyle);                                              // 0x0138(0x0580)  (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x05A0 PADDING_0969, class USlateWidgetStyleAsset*,                                         Style);                                                    // 0x06B8(0x0008)  (ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x05A8 PADDING_0969, class USlateBrushAsset*,                                               UncheckedImage);                                           // 0x06C0(0x0008)  (ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x05B0 PADDING_0969, class USlateBrushAsset*,                                               UncheckedHoveredImage);                                    // 0x06C8(0x0008)  (ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x05B8 PADDING_0969, class USlateBrushAsset*,                                               UncheckedPressedImage);                                    // 0x06D0(0x0008)  (ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x05C0 PADDING_0969, class USlateBrushAsset*,                                               CheckedImage);                                             // 0x06D8(0x0008)  (ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x05C8 PADDING_0969, class USlateBrushAsset*,                                               CheckedHoveredImage);                                      // 0x06E0(0x0008)  (ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x05D0 PADDING_0969, class USlateBrushAsset*,                                               CheckedPressedImage);                                      // 0x06E8(0x0008)  (ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x05D8 PADDING_0969, class USlateBrushAsset*,                                               UndeterminedImage);                                        // 0x06F0(0x0008)  (ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x05E0 PADDING_0969, class USlateBrushAsset*,                                               UndeterminedHoveredImage);                                 // 0x06F8(0x0008)  (ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x05E8 PADDING_0969, class USlateBrushAsset*,                                               UndeterminedPressedImage);                                 // 0x0700(0x0008)  (ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x05F0 PADDING_0969, TEnumAsByte<EHorizontalAlignment>,                                     HorizontalAlignment);                                      // 0x0708(0x0001)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x05F4 PADDING_0969, struct FMargin,                                                        Padding);                                                  // 0x070C(0x0010)  (ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0608 PADDING_0969, struct FSlateColor,                                                    BorderBackgroundColor);                                    // 0x0720(0x0028)  (Deprecated, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0630 PADDING_0969, bool,                                                                  IsFocusable);                                              // 0x0748(0x0001)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0638 PADDING_0969, struct FScriptMulticastDelegate,                                       OnCheckStateChanged);                                      // 0x0750(0x0010)  (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.CheckBox");
		return ptr;
	}


	void SetIsChecked(bool InIsChecked);
	void SetCheckedState(ECheckBoxState InCheckedState);
	bool IsPressed();
	bool IsChecked();
	ECheckBoxState GetCheckedState();
};

// Class UMG.CheckedStateBinding
// 0x0000 (FullSize[0x0068] - InheritedSize[0x0068])
// LastOffsetWithSize(0x0068)
class UCheckedStateBinding : public UPropertyBinding
{
public:
	//union
	//{
	//};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.CheckedStateBinding");
		return ptr;
	}


	ECheckBoxState GetValue();
};

// Class UMG.CircularThrobber
// 0x00A1 (FullSize[0x01A9] - InheritedSize[0x0108])
// LastOffsetWithSize(0x0108)
#define PADDING_096B - 0x0000 // Minimum to subtract -> (0000)
class UCircularThrobber : public UWidget
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_096B, int,                                                                   NumberOfPieces);                                           // 0x0108(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0004 PADDING_096B, float,                                                                 Period);                                                   // 0x010C(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		DEFINE_MEMBER_NNN(0x0008 PADDING_096B, float,                                                                 Radius);                                                   // 0x0110(0x0004)  (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
