#pragma once

// Name: Sq, Version: b21


#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

/*!!HELPER_DEF!!*/

/*!!DEFINE!!*/

namespace UFT
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// WidgetBlueprintGeneratedClass W_Tooltip_Vehicle.W_Tooltip_Vehicle_C
// 0x00D0 (FullSize[0x0310] - InheritedSize[0x0240])
// LastOffsetWithSize(0x0240)
#define PADDING_0007 - 0x0000 // Minimum to subtract -> (0000)
class UW_Tooltip_Vehicle_C : public USQToolTipBaseWidget
{
public:
	union
	{
		DEFINE_MEMBER_000(0x0000 PADDING_0007, struct FPointerToUberGraphFrame,                                       UberGraphFrame);                                           // 0x0240(0x0008)  (ZeroConstructor, Transient, DuplicateTransient)
		DEFINE_MEMBER_NNN(0x0008 PADDING_0007, class UVerticalBox*,                                                   VerticalBox_2);                                            // 0x0248(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0010 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem);                                // 0x0250(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0018 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_1);                            // 0x0258(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0020 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_2);                            // 0x0260(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0028 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_3);                            // 0x0268(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0030 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_4);                            // 0x0270(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0038 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_5);                            // 0x0278(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0040 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_6);                            // 0x0280(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0048 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_7);                            // 0x0288(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0050 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_8);                            // 0x0290(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0058 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_9);                            // 0x0298(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0060 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_10);                           // 0x02A0(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0068 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_11);                           // 0x02A8(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0070 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_12);                           // 0x02B0(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0078 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_13);                           // 0x02B8(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0080 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_14);                           // 0x02C0(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0088 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_15);                           // 0x02C8(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0090 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_16);                           // 0x02D0(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x0098 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_17);                           // 0x02D8(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x00A0 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_18);                           // 0x02E0(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x00A8 PADDING_0007, class UW_Tooltip_VehicleSeatItem_C*,                                   W_Tooltip_VehicleSeatItem_C_19);                           // 0x02E8(0x0008)  (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x00B0 PADDING_0007, class USQMapWidgetVehicle*,                                            Vehicle_Widget);                                           // 0x02F0(0x0008)  (Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
		DEFINE_MEMBER_NNN(0x00B8 PADDING_0007, TArray<struct FSQVehicleOccupantInfo>,                                 Occupancy);                                                // 0x02F8(0x0010)  (Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn)
		DEFINE_MEMBER_NNN(0x00C8 PADDING_0007, bool,                                                                  Is_Self_Team);                                             // 0x0308(0x0001)  (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
		DEFINE_MEMBER_NNN(0x00CC PADDING_0007, int,                                                                   My_Seat_ID);                                               // 0x030C(0x0004)  (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	};

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("WidgetBlueprintGeneratedClass W_Tooltip_Vehicle.W_Tooltip_Vehicle_C");
		return ptr;
	}


	void Update_Seat_ID(int Index);
	void Update_All_Seats(bool Is_Self_Team, int My_Seat_ID);
	void Construct();
	void ExecuteUbergraph_W_Tooltip_Vehicle(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
